# Data Cleaning
Series: GEPAYGAP			

Name: Gender monthly wages gap																	

Definition: Monthly wages of women divided by the monthly wages of men

Source: International Labour Organization (ILO); Economist Intelligence Unit (EIU) calculation

In [1]:
import pandas as pd 
import numpy as np
import csv 
import json

In [2]:
# df = pd.read_csv("GEPAYGAP.csv")
df = pd.read_csv("d3layout_data/GRSCFETL.csv") # Share of science graduates at tertiary level, female
# print(df.shape)  # countries, years
df.head()

,ISO,1998,1999,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012
0,ALB,NaN,NaN,60.8,NaN,NaN,75.2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,62.5,71.1
1,DZA,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.7,NaN,64.2,65.1,63.7,NaN
2,AND,NaN,NaN,NaN,NaN,30.0,23.5,11.8,13.6,NaN,NaN,10.0,NaN,NaN,NaN,33.3
3,AGO,NaN,50.0,NaN,NaN,41.2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,ATG,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,34.2,70.6,75.0,33.3

In [3]:
col_nulls = df.isna().sum()
print(col_nulls.sort_values()[0:10])
## pick a year with low amonut of nans

ISO      0
2010    53
2007    57
2008    57
2009    57
2004    64
2002    65
2005    66
2011    66
2000    71
dtype: int64

In [4]:
# get 2010 data only
df_2010 = df[['ISO', '2010']].copy()
print(df_2010.shape)

(133, 2)

In [5]:
df_2010.head()

   ISO  2010
0  ALB   NaN
1  DZA  65.1
2  AND   NaN
3  AGO   NaN
4  ATG  70.6

In [6]:
df_2010.dropna(inplace=True)
print(df_2010.shape)

(80, 2)

In [7]:
## NEW: map ISO -> Country name for better understandability in graph
with open('d3layout_data/iso_to_country_names.csv', mode='r') as infile:
    reader = csv.reader(infile)
    country_names = {rows[0]: rows[1] for rows in reader}
    # print(country_names)

country_names_dict = { v: k for k, v in country_names.items()}

def convert_iso_to_name(iso):
    if iso in country_names_dict:
        return country_names_dict[iso]
    else:
        return iso

In [8]:
# drop nans
df_2010.dropna(inplace=True)

df_2010.columns = ['name', 'value']

In [9]:
df_2010['name'] = df_2010['name'].apply(lambda x: convert_iso_to_name(x))

In [10]:
# df_2010.shape 
# df_2010.head()
df_2010.sort_values(by='value')

                    name    value
38              Ethiopia  19.0000
79           Netherlands  22.6000
25                 Chile  23.0000
125                  LCE  25.0675
123                  ECE  25.5143
..                   ...      ...
88                 Qatar  62.8000
1                Algeria  65.1000
83                  Oman  66.5000
4    Antigua and Barbuda  70.6000
93          Saudi Arabia  72.6000

[80 rows x 2 columns]

In [11]:
# df_2010.to_csv("gender_pay_gap_2010.csv", index=False)

##  Share of science graduates at tertiary level, female
# df_2010.to_csv("d3layout_data/share_science_graduates_fem_2010.csv", index=False)